---
kind: type
id: T:Autodesk.Revit.DB.JoinGeometryUtils
source: html/c45b6484-3efd-1d81-0b47-ba678857fff1.htm
---
# Autodesk.Revit.DB.JoinGeometryUtils

Utilities for joining and unjoining elements, and for managing the order in which elements are joined.

## Syntax (C#)
```csharp
public static class JoinGeometryUtils
```